{
    "filename": "RailUK_DatabaseDevelopmentCaseStudy.pdf",
    "file_type": "pyq",
    "extracted_at": "20251108_104816",
    "text_length": 5022,
    "text": "--- Page 1 ---\nRailUK  Database Development Case Study  \nYou have been appointed as a Database Developer  for RailUK Logistics Ltd , a national freight \ntransport and logistics company based in the United Kingdom. RailUK  manages freight trains, \nwarehouses, and delivery hubs across the country, working with both large corporate clients (e.g., \nsupermarkets, manufacturers) and SMEs.  The company has expanded rapidly into multi -modal \nlogistics  (rail, road, last -mile delivery), and now faces  fragmented records across regions , \ninefficiencies in cargo tracking , lack of integrated client billing and scheduling , and s ecurity lapses \nin staff access to sensitive data.  \nRailUK’s IT Department has been tasked with developing a new database system  using  Oracle \nApplication Express (APEX)  (preferred) or Oracle SQL Developer . The database will support \nenterprise -level operations including shipment scheduling, cargo tracking, warehouse \nmanagement, and customer billing.  \n \nStage One : Database Design  \nYou are required to:  \n1. Design the database schema  with a clear structure including all entities, attributes, \nrelationships, data types, and constraints while ensuring  referential integrity.  \n2. Normalise the data  (to 3NF)  to avoid redundancy and anomalies.  \n3. Implement  the tables  in Oracle (APEX or SQL Developer) , ensuring all constraints such \nas primary keys, foreign keys, and unique constraints are defined.  \nEntities for this case study include (minimum):  \n• Clients  (corporate or SME; contact details, industry sector)  \n• Shipments  (unique shipment ID, cargo details, weight, delivery deadlines)  \n• TransportModes  (rail, lorry, last -mile van)  \n• Schedules  (routes, departure/arrival times, associated shipment IDs)  \n• Warehouses  (location, storage capacity, manager details)  \n• Staff  (roles: drivers, logistics officers, admin)  \n• Invoices  (linked to shipments and clients)  \n• Payments  (status, amounts, method)  \n• Suppliers  (e.g., fuel, maintenance contractors)  \nYou are encouraged to expand with  sub-entities  such as CargoType , StaffRoles , MaintenanceLogs  \nif justified.  Please complete the weekly lab s to get familiar with the necessary SQL commands.  \n \nStage Two : Data Population & Queries  \nOnce the schema is built : \n1. Populate  each table with at least 20 realistic records  suitable for this kind of company.  \n2. Demonstrate INSERT, UPDATE, DELETE  operations with appropriate examples.  \n\n--- Page 2 ---\n3. Run basic  queries  (SELECT,  filters, joins) and advanced queries  (aggregates, GROUP \nBY, HAVING, complex filters, nested subqueries).  \n4. Demonstrate at least three  real-world reporting  queries, e.g.:  \n• List all shipments delayed beyond deadline, grouped by region.  \n• Calculate total monthly revenue per client sector . \n \nStage Three: Optimisation , Security  & Research  \nYou will  optimis e and secur e the database  and do some  researc h on optimisation techniques.  \nOptimisation:  \n• Create indexes  on frequently queried attributes (e.g., shipment ID, client ID).  \n• Use partitioning  on large tables (e.g., Shipments by year, Invoices by quarter).  \n• Explore query optimisation techniques  (such as cost -based optimisation and indexing \nstrategies ) to demonstrate performance impact  and implement improvements.  \n• Implement stored procedures/functions  for recurring operations (e.g., invoice generation, \nshipment tracking queries).  \nSecurity : (For this part, you will need to write an SQL script  using your favourite SQL \nenvironment/editor as it is not possible to perform these actions in APE X) \n• Create users  with role -based access (Admin, Logistics Officer, Warehouse Staff).  \n• Apply GRANT/REVOKE  to enforce least -privilege access.  \n• Demonstrate SQL injection awareness  with mitigations.  \nResearch Component — Literature Review ( 600 words)  \nDrawing upon at least 6 peer-reviewed academic sources plus reputable industry white papers \n(e.g., Oracle, ACM SIGMOD, VLDB) , you are required to produce a literature review that:  \n1. Surveys  academic and industry research on optimisation in RDBMS (query processing, \nindexing, partitioning, clustering, cost -based optimisation, parallel execution).  \n2. Critically evaluates recent advances  (e.g., adaptive query optimisation in Oracle 19c/23c, \nin-memory column stores, autonomous indexing).  \n3. Discusses open challenges  in the field (e.g., balancing OLTP vs OLAP workloads, hybrid \nrelational/NoSQL optimisation, cloud cost/performance trade -offs).  \n4. Connects insights back to your implementation in RailUK Logistics  (important! ) \n \nAssessment Notes:  \n• You should demonstrate the impact of database optimisation techniques  by highlighting \nperformance metrics (e.g., costs, cardinality).  \n• Additional database optimisation and security measures will be rewarded with extra credit \nin the assessment.  \n• Remember , you will have to write an SQL script for the security part because it cannot be \nimplemented in APEX.",
    "preview": "--- Page 1 ---\nRailUK  Database Development Case Study  \nYou have been appointed as a Database Developer  for RailUK Logistics Ltd , a national freight \ntransport and logistics company based in the United Kingdom. RailUK  manages freight trains, \nwarehouses, and delivery hubs across the country, working with both large corporate clients (e.g., \nsupermarkets, manufacturers) and SMEs.  The company has expanded rapidly into multi -modal \nlogistics  (rail, road, last -mile delivery), and now faces  "
}